# AzureBlobIO example

In [1]:
import pandas as pd
from azure.storage import blob

from azureblobio import AzureBlobIO

### Blob Service creation

In [9]:
blob_service = blob.BlockBlobService(account_name='equancypublic')

### Access to files

In [10]:
titanic_df = pd.read_csv(AzureBlobIO(blob_service, 'datasets', 'titanic.csv'))

In [12]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S

In [13]:
titanic_df.shape

(1309, 12)